Autodesk.Revit.DB.Structure.RebarHandlePositionData.GetDistributionPath
Gets the distribution path currently stored in the rebar.
Remarks:
For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars.
The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.
Returns:
Returns array of curves that represent the distribution path.
Since:
2018.1

Autodesk.Revit.DB.Structure.RebarHandlePositionData.SetPosition(System.Int32,Autodesk.Revit.DB.XYZ)
Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully.
handleTag:
The tag of the handle.
position:
Position of the handle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandlePositionData.GetBarGeometry(System.Int32)
Returns the geometry for a bar at the specified index currently in the Rebar.
barIndex:
The index of the bar. Should be a number between 0 and GetNumberOfBars() - 1.
Returns:
Returns an array of curves that defines the bar at the specified index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, GetNumberOfBars()-1 ].
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandlePositionData.GetNumberOfBars
Gets the number of bars currently in the rebar.
Returns:
Returns the number of bars currently in the rebar.
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandlePositionData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarHandlePositionData
The class that contains data for the handle position calculation.
Since:
2018